UTAF_Base/requestFiles/BPS_SubscribedPlan_CancelPlan.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:v4.context.vss.objects.bgc" xmlns:urn1="urn:v1.subscribedplan.bps.services.bgc" xmlns:urn2="urn:v1.bpsmodel.bps.objects.bgc">
   <soapenv:Header>
      <urn:Context version="4.0">
         <urn:correlationId>${Req_corrId}</urn:correlationId>
         <urn:consumerApplicationId>TST</urn:consumerApplicationId>
         <urn:endUserId>id000000</urn:endUserId>
         <urn:endUserLanguage>EN</urn:endUserLanguage>
         <!--Optional:-->
         <urn:propagatedKey>?</urn:propagatedKey>
      </urn:Context>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:RequestDataCancelPlan version="1.1">
         <urn1:userContext>
            <urn2:applicationNm>TST</urn2:applicationNm>
            <urn2:correlationId>${Req_corrId}</urn2:correlationId>
            <urn2:userId>id000000</urn2:userId>
            <urn2:languageIso2Code>EN</urn2:languageIso2Code>
         </urn1:userContext>
         <urn1:planType>${Req_planType}</urn1:planType>
         <urn1:custId>${Req_custId}</urn1:custId>
         <urn1:assignId>${Req_assignId}</urn1:assignId>
         <urn1:endDate>${Req_endDate}</urn1:endDate>
         <urn1:sendToBilling>${Req_sendToBilling}</urn1:sendToBilling>
      </urn1:RequestDataCancelPlan>
   </soapenv:Body>
</soapenv:Envelope>